In [1]:
import pandas

In [2]:
d = pandas.DataFrame()
type(d)

pandas.core.frame.DataFrame

In [6]:
d = pandas.DataFrame([['Andy', 46, 'Engineer'], ['Jane', 33, 'Nurse'], ['Robert', 21, 'Student'], ['Maria', 30, 'Student']])
type(d)

pandas.core.frame.DataFrame

In [7]:
d

        0   1         2
0    Andy  46  Engineer
1    Jane  33     Nurse
2  Robert  21   Student
3   Maria  30   Student

In [8]:
d = pandas.DataFrame([['Andy', 46, 'Engineer'], ['Jane', 33, 'Nurse'], ['Robert', 21, 'Student'], ['Maria', 30, 'Student']], columns=["Name", "Age", "Occupation"], index=["ID1", "ID2", "ID3", "ID4"])
d

       Name  Age Occupation
ID1    Andy   46   Engineer
ID2    Jane   33      Nurse
ID3  Robert   21    Student
ID4   Maria   30    Student